emacs/lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2018-08-16 Thu 09:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common Lisp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="common Lisp" />

<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />

</head>
<body>
<div id="content">
<h1 class="title">Common Lisp</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga188864">1. 安装</a></li>
<li><a href="#orgf41a522">2. 输入输出</a>
<ul>
<li><a href="#org67998bb">2.1. format</a></li>
<li><a href="#org2128d1a">2.2. read</a></li>
</ul>
</li>
<li><a href="#orgcac7beb">3. 符号</a></li>
<li><a href="#orga423f3f">4. 列表</a>
<ul>
<li><a href="#orge7c33da">4.1. 空列表</a></li>
<li><a href="#orgb830e2f">4.2. 创建</a></li>
<li><a href="#orgf693c7b">4.3. 索引</a></li>
<li><a href="#org84e3ebe">4.4. 深拷贝</a></li>
<li><a href="#orga60f071">4.5. map</a></li>
</ul>
</li>
<li><a href="#orged90190">5. 函数</a>
<ul>
<li><a href="#org4ea0c56">5.1. 参数</a></li>
<li><a href="#org8b4fa8b">5.2. 函数对象</a></li>
</ul>
</li>
<li><a href="#org20c8c33">6. 变量</a>
<ul>
<li><a href="#orgd6d637e">6.1. 词法(lexical)变量</a></li>
<li><a href="#orgf6e54ee">6.2. 动态(dynamic)变量</a></li>
<li><a href="#org8edd534">6.3. 赋值</a></li>
<li><a href="#orga845655">6.4. 类型</a></li>
<li><a href="#orga53a5ee">6.5. 等式</a></li>
</ul>
</li>
<li><a href="#orge25e443">7. 控制语句</a>
<ul>
<li><a href="#orgee529c2">7.1. if</a></li>
<li><a href="#orgd6eee6f">7.2. and &amp; or</a></li>
<li><a href="#orga09b751">7.3. do macro</a></li>
<li><a href="#org0cd5137">7.4. dolist</a></li>
</ul>
</li>
<li><a href="#org197e1a3">8. 数据结构</a>
<ul>
<li><a href="#org32b1684">8.1. 二叉树</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga188864" class="outline-2">
<h2 id="orga188864"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
<p>
Install Slime, SBCL
</p>
<ul class="org-ul">
<li>windows 下定义环境变量 SBCL_Home</li>
</ul>
</div>
</div>
<div id="outline-container-orgf41a522" class="outline-2">
<h2 id="orgf41a522"><span class="section-number-2">2</span> 输入输出</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org67998bb" class="outline-3">
<h3 id="org67998bb"><span class="section-number-3">2.1</span> format</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>format t <span style="color: #2d9574;">"~A plus ~A equals ~A. ~%"</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span> <span style="color: #6c3163;">(</span>+ <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2128d1a" class="outline-3">
<h3 id="org2128d1a"><span class="section-number-3">2.2</span> read</h3>
</div>
</div>
<div id="outline-container-orgcac7beb" class="outline-2">
<h2 id="orgcac7beb"><span class="section-number-2">3</span> 符号</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-lisp">'Artichoke
</pre>
</div>
<p>
符号（通常）不对自身求值，所以要是想引用符号，应该像上例那样用'引用它。
</p>
<ul class="org-ul">
<li>符号的用途是作为变量的名字，符号必须要被引用，不然会被当作变量。</li>
</ul>
</div>
</div>

<div id="outline-container-orga423f3f" class="outline-2">
<h2 id="orga423f3f"><span class="section-number-2">4</span> 列表</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-lisp">'<span style="color: #3a81c3;">(</span>my <span style="color: #4e3163;">3</span> <span style="color: #2d9574;">"Sons"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
使用列表必须要引用，不然 Lisp 会以为这是个函数调用。
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>list 'my <span style="color: #6c3163;">(</span>+ <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">1</span><span style="color: #6c3163;">)</span> <span style="color: #2d9574;">"Sons"</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; &#20351;&#29992; list &#20989;&#25968;&#21019;&#24314;&#21015;&#34920;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; (MY 3 "Sons")</span>
</pre>
</div>
</div>
<div id="outline-container-orge7c33da" class="outline-3">
<h3 id="orge7c33da"><span class="section-number-3">4.1</span> 空列表</h3>
<div class="outline-text-3" id="text-4-1">
<p>
() or nil
</p>
</div>
</div>
<div id="outline-container-orgb830e2f" class="outline-3">
<h3 id="orgb830e2f"><span class="section-number-3">4.2</span> 创建</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<ul class="org-ul">
<li><a id="org8e1560c"></a>cons<br />
<div class="outline-text-4" id="text-org8e1560c">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>setf x <span style="color: #6c3163;">(</span>cons 'a nil<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>consp: 检查是否一个 object 为 cons 对象</li>
</ul>
</div>
</li>
<li><a id="org22199ec"></a>make-list<br /></li>
</ul>
</div>
<div id="outline-container-orgf693c7b" class="outline-3">
<h3 id="orgf693c7b"><span class="section-number-3">4.3</span> 索引</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>nth, nthcdr, last, car, cdr, first -&gt; tenth</li>
</ul>
</div>
</div>
<div id="outline-container-org84e3ebe" class="outline-3">
<h3 id="org84e3ebe"><span class="section-number-3">4.4</span> 深拷贝</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>copy-list</li>
<li>copy-tree</li>
<li>substitute</li>
<li><p>
subst
</p>

<p>
替换子树里的所有元素
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orga60f071" class="outline-3">
<h3 id="orga60f071"><span class="section-number-3">4.5</span> map</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<ul class="org-ul">
<li><a id="org779a2e2"></a>mapcar<br />
<div class="outline-text-4" id="text-org779a2e2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>mapcar #'<span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>+ x <span style="color: #4e3163;">10</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
        '<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; (11 12 13)</span>
<span style="color: #3a81c3;">(</span>mapcar #'list
        '<span style="color: #6c3163;">(</span>a b c<span style="color: #6c3163;">)</span>
        '<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span> <span style="color: #4e3163;">4</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; &#22810;&#21015;&#34920;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; ((A 1) (B 2) (C 3))</span>
</pre>
</div>
</div>
</li>
<li><a id="orge2212fd"></a>maplist<br />
<div class="outline-text-4" id="text-orge2212fd">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>maplist #'<span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span> x<span style="color: #6c3163;">)</span>
         '<span style="color: #6c3163;">(</span>a b c<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; ((A B C) (B C) (C))</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orged90190" class="outline-2">
<h2 id="orged90190"><span class="section-number-2">5</span> 函数</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4ea0c56" class="outline-3">
<h3 id="org4ea0c56"><span class="section-number-3">5.1</span> 参数</h3>
<div class="outline-text-3" id="text-5-1">
<p>
参数四种类型按解析顺序列出：必要形参，optional 形参，rest 形参，keyword 形参。
</p>
</div>
<ul class="org-ul">
<li><a id="orgf81408f"></a>注意点<br />
<div class="outline-text-4" id="text-orgf81408f">
<p>
避免&amp;optional 与&amp;key 混合使用，为保持更好的扩展性，应使用&amp;key。
&amp;rest 与&amp;key 一同使用时，两者都会解析。例如：
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">foo</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">&amp;rest</span> values <span style="color: #ba2f59; font-weight: bold;">&amp;key</span> a b<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>list rest a b<span style="color: #6c3163;">)</span>
<span style="color: #6c3163;">(</span>foo <span style="color: #3a81c3;">:a</span> <span style="color: #4e3163;">1</span> <span style="color: #3a81c3;">:b</span> <span style="color: #4e3163;">2</span><span style="color: #6c3163;">)</span><span style="color: #2aa1ae; background-color: #ecf3ec;">; -&gt; ((:A 1 :B 2) 1 2)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8b4fa8b" class="outline-3">
<h3 id="org8b4fa8b"><span class="section-number-3">5.2</span> 函数对象</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>function +<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">or</span>
#'+
<span style="color: #3a81c3;">(</span>apply #'+ '<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
#'作为 function 的缩写
</p>
</div>
<ul class="org-ul">
<li><a id="orge2346f5"></a>lambda<br />
<div class="outline-text-4" id="text-orge2346f5">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>funcall #'<span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span>x y<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>+ x y<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;=&gt;5</span>
<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span>x y<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>+ x y<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;=&gt;5</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org20c8c33" class="outline-2">
<h2 id="org20c8c33"><span class="section-number-2">6</span> 变量</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd6d637e" class="outline-3">
<h3 id="orgd6d637e"><span class="section-number-3">6.1</span> 词法(lexical)变量</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<ul class="org-ul">
<li><a id="orgc33f1f2"></a>Let<br />
<div class="outline-text-4" id="text-orgc33f1f2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>x <span style="color: #4e3163;">10</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>y <span style="color: #4e3163;">20</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>+ x y<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>let 声明的变量，作用域仅是 let 语句内。</li>
<li>body 中最后一个表达式返回的值，将作为 let 表达式的值返回。</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org37fe2c4"></a>let*<br />
<div class="outline-text-5" id="text-org37fe2c4">
<p>
let*允许变量引用变量列表中早先引入的变量
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let*</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>x <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>y <span style="color: #67b11d;">(</span>+ x <span style="color: #4e3163;">1</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>list x y<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
等同于嵌套的 let
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>x <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>y <span style="color: #b1951d;">(</span>+ x <span style="color: #4e3163;">10</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>list x y<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</li>

<li><a id="org3087cc3"></a>闭包<br />
<div class="outline-text-4" id="text-org3087cc3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>count <span style="color: #4e3163;">0</span><span style="color: #2d9574;">)</span> #'<span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #67b11d;">()</span> <span style="color: #67b11d;">(</span>setf count <span style="color: #b1951d;">(</span><span style="color: #4e3163;">1</span> + count<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
其中的匿名函数被称为一个闭包
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgf6e54ee" class="outline-3">
<h3 id="orgf6e54ee"><span class="section-number-3">6.2</span> 动态(dynamic)变量</h3>
<div class="outline-text-3" id="text-6-2">
<p>
有时被称为特殊(special)变量。通常用作全局变量。其特殊是因为其作用域是动态作用域，运行时决定。
</p>

<p>
每个动态变量都会对应一个全局绑定关系栈，遇到局部重名定义或者新绑定时，将新的关系压入栈，离开该作用时出栈。
</p>

<p>
声明有 <b>defvar</b> 和 <b>defparameter</b> 两种方式。
</p>
</div>

<ul class="org-ul">
<li><a id="org487ad9d"></a>defvar<br />
<div class="outline-text-4" id="text-org487ad9d">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defvar</span> <span style="color: #715ab1;">*count*</span> <span style="color: #4e3163;">0</span>
  <span style="color: #2aa1ae;">"Count of ..."</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<ul class="org-ul">
<li><b>defvar</b> 在发现变量已被定义时，不进行赋值</li>
<li><b>defvar</b> 还可以不使用初始值。这样的变量称为未绑定的(unbound)。</li>
<li>局部变量也可以声明为动态变量，使用 <b>declare</b> ，一般不常用。</li>
</ul>
</div>
</li>

<li><a id="orgd450288"></a>defparameter<br />
<div class="outline-text-4" id="text-orgd450288">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defparameter</span> <span style="color: #715ab1;">*gap*</span> <span style="color: #4e3163;">0.001</span>
  <span style="color: #2d9574;">"Gaps of ..."</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org897adbd"></a>defconstant<br />
<div class="outline-text-4" id="text-org897adbd">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defconstant</span> <span style="color: #715ab1;">+limit</span> <span style="color: #4e3163;">12345</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>可在名字后面加上“+”约定为常量</li>
<li>没有全局变量这么通用</li>
</ul>
</div>
</li>

<li><a id="orgc46be7f"></a>boundp<br />
<div class="outline-text-4" id="text-orgc46be7f">
<p>
boundp 检查是否为一个全局变量
</p>
</div>
</li>

<li><a id="orgc775c38"></a>局部重绑定<br />
<div class="outline-text-4" id="text-orgc775c38">
<p>
将全局对象的改变限定在函数体内，可使用 <b>let</b> 对全局对象进行重新绑定。
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defvar</span> <span style="color: #715ab1;">*x*</span> <span style="color: #4e3163;">10</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">foo</span> <span style="color: #6c3163;">()</span> <span style="color: #6c3163;">(</span>print *x*<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">bar</span> <span style="color: #6c3163;">()</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span>*x* <span style="color: #4e3163;">20</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>foo<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>foo<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>bar<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">-&gt;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">20</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">10</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8edd534" class="outline-3">
<h3 id="org8edd534"><span class="section-number-3">6.3</span> 赋值</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<b>setf</b> 可以用来给全局或局部变量赋值。
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>setf *glob* <span style="color: #4e3163;">98</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
如果 setf 的第一个实参是符号（symbol），且符号不是某个局部变量的名字，则 setf 把这个符号设为全局变量
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>setf x <span style="color: #6c3163;">(</span>list 'a 'b 'c<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
给列表元素引用赋值
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>setf <span style="color: #6c3163;">(</span>car x<span style="color: #6c3163;">)</span> 'n<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga845655" class="outline-3">
<h3 id="orga845655"><span class="section-number-3">6.4</span> 类型</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>typep <span style="color: #4e3163;">27</span> 'integer<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga53a5ee" class="outline-3">
<h3 id="orga53a5ee"><span class="section-number-3">6.5</span> 等式</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<b>eql</b> 比较是否为同一对象， <b>equal</b> 比较对象内容。本质上 <b>equal</b> 若它的参数打印出的值相同时，返回真。
</p>
</div>
</div>
</div>

<div id="outline-container-orge25e443" class="outline-2">
<h2 id="orge25e443"><span class="section-number-2">7</span> 控制语句</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgee529c2" class="outline-3">
<h3 id="orgee529c2"><span class="section-number-3">7.1</span> if</h3>
<div class="outline-text-3" id="text-7-1">
<p>
if 是特殊的操作符。不能用函数来实现，因为实参在函数调用时永远会被求值，而 if 的特点是，只有最后两个实参的其中一个会被求值。if 的最后一个实参是选择性的。如果忽略它的话，缺省值是 nil。
</p>
</div>
</div>
<div id="outline-container-orgd6eee6f" class="outline-3">
<h3 id="orgd6eee6f"><span class="section-number-3">7.2</span> and &amp; or</h3>
<div class="outline-text-3" id="text-7-2">
<p>
and 和 or 是宏。宏和特殊的操作符一样，可以绕过一般的求值规则。
</p>
</div>
</div>
<div id="outline-container-orga09b751" class="outline-3">
<h3 id="orga09b751"><span class="section-number-3">7.3</span> do macro</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">do</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>VAR INIT [STEP]<span style="color: #2d9574;">)</span>...<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>END-TEST [RESULT...]<span style="color: #6c3163;">)</span> BODY...<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0cd5137" class="outline-3">
<h3 id="org0cd5137"><span class="section-number-3">7.4</span> dolist</h3>
<div class="outline-text-3" id="text-7-4">
<p>
遍历列表
</p>
</div>
</div>
</div>
<div id="outline-container-org197e1a3" class="outline-2">
<h2 id="org197e1a3"><span class="section-number-2">8</span> 数据结构</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org32b1684" class="outline-3">
<h3 id="org32b1684"><span class="section-number-3">8.1</span> 二叉树</h3>
<div class="outline-text-3" id="text-8-1">
<p>
car 代表左子数，cdr 代表右子数
</p>
</div>
</div>
</div>
</div>
</body>
</html>
